# 09: Membagi Data Frame menjadi dua secara acak

# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Persiapan Data Frame

In [3]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  13   7  14  18  13
1  10  14   5   4   6
2  16   2  13  14  16
3   1  17   3  19  11
4  17   4   8  19   4
5   3  18   7  19  15
6   6  14  18   1  17
7   9  15  14   6   6
8   1  15  12  16  14
9   4   7  10   6  12

# Membagi Data Frame menjadi dua secara acak berdasarkan proporsi tertentu

In [5]:
df.shape

(10, 5)

In [7]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (7, 5)
df_2 shape: (3, 5)

In [9]:
df_1

    A   B   C   D   E
1  10  14   5   4   6
4  17   4   8  19   4
9   4   7  10   6  12
0  13   7  14  18  13
7   9  15  14   6   6
2  16   2  13  14  16
3   1  17   3  19  11

In [11]:
df_2

   A   B   C   D   E
5  3  18   7  19  15
6  6  14  18   1  17
8  1  15  12  16  14